# Databases and python

In this notebook, we will create a database, upload data to it, and perform some queries to it

## sqllite

sqllite is a super light weight database. Unlike other database solutions, it is serverless. All of the database is stored in one file. Anyone that has access to that file can access the file.  For a typical DB solution, you will have a server that manages the queries that come in, handle security, accounts, and much more. For learning the basics of SQL, sqllite is all we need

## sqllite3

sqllite3 is the name of the python package which creates a sqllite databse, connects to it, and sends queries to it.

In [1]:
import sqlite3
# this connects to a file db.sqllite3. if it doesnt exist, it will create it
con = sqlite3.connect('db.sqlite3')

In [2]:
# to execute a SQL command, you need to create a cursor
cur = con.cursor()

## CREATE a table

In [3]:
cur.execute("""
CREATE TABLE customers (
    id integer PRIMARY KEY,
    first_name text NOT NULL,
    last_name text NOT NULL);
    """)

## INSERT into table

In [4]:
cur.execute("""
INSERT INTO customers
(first_name, last_name)
VALUES ('John', 'Smith');
    """)

## SELECT (read from a table)

In [5]:
cur.execute("""
SELECT * FROM customers;
    """)
cur.fetchall()

[(1, 'John', 'Smith')]

# DROP TABLE

In [6]:
cur.execute("""
DROP TABLE IF EXISTS customers;
    """)
cur.execute("""
SELECT * FROM customers;
    """)
# we get an error as expected

OperationalError: no such table: customers

In [7]:
cur.close() # always close a cursor connection when you are done with it

# Now do it with pandas!

pandas is a great python package to deal with tabular data.  It can also handle connections to and from a database as well!

If we wanted we could open a csv, and upload that to our database. Instead, we will just create a dataframe by hand.

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(data=[["John","Smith",21],["Jane","Doe",34]], columns =["first_name","last_name", "age"])
df

  first_name last_name  age
0       John     Smith   21
1       Jane       Doe   34

In [10]:
df.to_sql("customers2",con=con, if_exists="replace", index=False)

In [11]:
pd.read_sql("select * from customers2;",con=con)

  first_name last_name  age
0       John     Smith   21
1       Jane       Doe   34

In [12]:
pd.read_sql("select * from customers2 where first_name == 'John';",con=con)

  first_name last_name  age
0       John     Smith   21

In [13]:
pd.read_sql("select * from customers2 where age >30;",con=con)

  first_name last_name  age
0       Jane       Doe   34